{
  "filmes": [
    {
      "id": 1,
      "nome": "Vingadores: Guerra Infinita",
      "ano": "2018",
      "diretor": "Joe Russo, Anthony Russo",
      "genero": "Ação",
      "descricao": "Homem de Ferro, Thor, Hulk e os Vingadores se unem para combater seu inimigo mais poderoso, o maligno Thanos. Em uma missão para coletar todas as seis pedras infinitas, Thanos planeja usá-las para infligir sua vontade maléfica sobre a realidade.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/vingadores-guerra-infinita.jpg"
        }
      ]
    },
    {
      "id": 2,
      "nome": "Círculo de Fogo",
      "ano": "2013",
      "diretor": "Guillermo del Toro",
      "genero": "Ação",
      "descricao": "Criaturas monstruosas conhecidas como Kaiju começam a emergir do mar. Para combatê-los, a humanidade desenvolve uma série de robôs gigantescos, os Jaegers. Cada um é controlado por duas pessoas por meio de uma conexão neural. Entretanto, mesmo os Jaegers se mostram insuficientes para derrotar os Kaiju. Diante deste cenário, a última esperança é um velho robô, que passa a ser comandado por um antigo piloto e uma pessoa em treinamento.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/circulo-de-fogo.jpg"
        }
      ]
    },
    {
      "id": 3,
      "nome": "O Homem de Aço",
      "ano": "2013",
      "diretor": "Zack Snyder",
      "genero": "Ação",
      "descricao": "Com a iminente destruição de Krypton, seu planeta natal, Jor-El e sua mulher procuram preservar a raça enviando o filho recém-nascido para a Terra. A nave espacial da criança aterrissa na fazenda de Jonathan e Martha Kent, que o batizam de Clark e o criam como seu próprio filho. Apesar das habilidades extraordinárias levarem o Clark adulto a viver à margem da sociedade, ele precisa se tornar um herói para salvar aqueles que ama de uma terrível ameaça.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/o-homem-de-aco.jpeg"
        }
      ]
    },
    {
      "id": 4,
      "nome": "Velozes e Furiosos 8",
      "ano": "2017",
      "diretor": "F. Gary Gray",
      "genero": "Ação",
      "descricao": "Depois que Brian e Mia se aposentaram, e o resto da equipe foi exonerado, Dom e Letty estão em lua de mel e levam uma vida pacata e completamente normal. Mas a adrenalina do passado volta com tudo quando uma mulher misteriosa faz com que Dom retorne ao mundo do crime e da velocidade.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/velozes-e-furiosos-8.jpg"
        }
      ]
    },
    {
      "id": 5,
      "nome": "Mulher-Maravilha",
      "ano": "2017",
      "diretor": "Patty Jenkins",
      "genero": "Ação",
      "descricao": "Treinada desde cedo para ser uma guerreira imbatível, Diana Prince nunca saiu da paradisíaca ilha em que é reconhecida como princesa das Amazonas. Quando o piloto Steve Trevor sofre um acidente e cai em uma praia do local, ela descobre que uma guerra sem precedentes está se espalhando pelo mundo e decide deixar seu lar certa de que pode parar o conflito. Lutando para acabar com a guerra, Diana percebe o alcance de seus poderes e sua verdadeira missão na Terra.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/wonder-woman.jpg"
        }
      ]
    },
    {
      "id": 6,
      "nome": "Eu Sou a Lenda",
      "ano": "2007",
      "diretor": "Francis Lawrence",
      "genero": "Terror",
      "descricao": "Robert Neville é um brilhante cientista e o único sobrevivente de uma epidemia que transformou os humanos em mutantes sedentos por sangue. Andando pela cidade de Nova York, ele procura por outros possíveis sobreviventes e tenta achar a cura da praga usando seu próprio sangue, que é imune.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/eu-sou-a-lenda.jpg"
        }
      ]
    },
    {
      "id": 7,
      "nome": "A Bruxa",
      "ano": "2015",
      "diretor": "Robert Eggers",
      "genero": "Terror",
      "descricao": "Em uma fazenda no século 17, uma histeria religiosa toma conta de uma família que acusa a filha mais velha pelo desaparecimento do seu irmão ainda bebê.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/a-bruxa.jpg"
        }
      ]
    },
    {
      "id": 8,
      "nome": "Corra!",
      "ano": "2017",
      "diretor": "Jordan Peele",
      "genero": "Terror",
      "descricao": "Um jovem fotógrafo descobre um segredo sombrio quando conhece os pais aparentemente amigáveis da sua namorada.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/corra.jpg"
        }
      ]
    },
    {
      "id": 9,
      "nome": "Invocação do Mal",
      "ano": "2013",
      "diretor": "James Wan",
      "genero": "Terror",
      "descricao": "Os investigadores paranormais Ed e Lorraine Warren trabalham para ajudar a família aterrorizada por uma entidade demoníaca em sua fazenda.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/invocacao-do-mal.jpg"
        }
      ]
    },
    {
      "id": 10,
      "nome": "Hereditário",
      "ano": "2018",
      "diretor": "Ari Aster",
      "genero": "Terror",
      "descricao": "Após a morte da reclusa avó, a família Graham começa a desvendar algumas coisas. Mesmo após a partida da matriarca, ela permanece como se fosse uma sombra sobre a família, especialmente sobre a solitária neta adolescente, Charlie, por quem ela sempre manteve uma fascinação não usual. Com um crescente terror tomando conta da casa, a família explora lugares mais escuros para escapar do infeliz destino que herdaram.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/hereditario.jpg"
        }
      ]
    },
    {
      "id": 11,
      "nome": "O Auto da Compadecida",
      "ano": "2018",
      "diretor": "Guel Arraes",
      "genero": "Comédia",
      "descricao": "O filme mostra as aventuras de João Grilo e Chicó, dois nordestinos pobres que vivem de golpes para sobreviver. Eles estão sempre enganando o povo de um pequeno vilarejo no sertão da Paraíba, inclusive o temido cangaceiro Severino de Aracaju, que os persegue pela região. Somente a aparição da Nossa Senhora poderá salvar esta dupla.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/o-auto-da-compadecida.jpg"
        }
      ]
    },
    {
      "id": 12,
      "nome": "Se Beber, Não Case!",
      "ano": "2009",
      "diretor": "Todd Phillips",
      "genero": "Comédia",
      "descricao": "Em Las Vegas para realizar uma despedida de solteiro, três amigos e padrinhos de casamento acabam se perdendo do amigo noivo depois de uma noitada de bebedeiras.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/se-beber-nao-case.jpg"
        }
      ]
    },
    {
      "id": 13,
      "nome": "As Branquelas",
      "ano": "2004",
      "diretor": "Keenen Ivory Wayans",
      "genero": "Comédia",
      "descricao": "Dois irmãos agentes do FBI, Marcus e Kevin Copeland, acidentalmente evitam que bandidos sejam presos em uma apreensão de drogas. Como castigo, eles são forçados a escoltar um par de socialites nos Hamptons. Porém, quando as meninas descobrem o plano da agência, se recusam a ir. Sem opções, Marcus e Kevin decidem posar como as irmãs, transformando-se de homens afro-americanos em um par de loiras.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/as-branquelas.jpg"
        }
      ]
    },
    {
      "id": 14,
      "nome": "O Virgem de 40 anos",
      "ano": "2005",
      "diretor": "Judd Apatow",
      "genero": "Comédia",
      "descricao": "Andy fica horrorizado quando seus colegas de trabalho descobrem que, aos 40 anos, ele ainda é virgem. Agora, seus amigos tentam ajudá-lo a encontrar uma garota e perder a sua virgindade.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/o-virgem-de-40-anos.jpg"
        }
      ]
    },
    {
      "id": 15,
      "nome": "O Homem Que Desafiou o Diabo",
      "ano": "2007",
      "diretor": "Moacyr Góes",
      "genero": "Comédia",
      "descricao": "Zé Araújo é um viajante recém-chegado em Jardim dos Caiacós. Ele seduz a filha de um comerciante e é obrigado a se casar com ela. Araújo torna-se um escravo do sogro e da mulher. Percebendo que vira motivo de piada na cidade, ele resolve mudar de vida e começar uma nova.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/o-homem-que-desafiou-o-diabo.jpg"
        }
      ]
    },
    {
      "id": 16,
      "nome": "Planeta dos Macacos: A Origem",
      "ano": "2011",
      "diretor": "Rupert Wyatt",
      "genero": "Ficção científica",
      "descricao": "Uma experiência científica resulta em um chimpanzé com uma inteligência superior que acaba liderando uma rebelião contra os humanos para dominar o planeta Terra.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/planeta-dos-macacos-a-origem.jpg"
        }
      ]
    },
    {
      "id": 17,
      "nome": "A Origem",
      "ano": "2010",
      "diretor": "Christopher Nolan",
      "genero": "Ficção científica",
      "descricao": "Dom Cobb é um ladrão com a rara habilidade de roubar segredos do inconsciente, obtidos durante o estado de sono. Impedido de retornar para sua família, ele recebe a oportunidade de se redimir ao realizar uma tarefa aparentemente impossível: plantar uma ideia na mente do herdeiro de um império. Para realizar o crime perfeito, ele conta com a ajuda do parceiro Arthur, o discreto Eames e a arquiteta de sonhos Ariadne. Juntos, eles correm para que o inimigo não antecipe seus passos.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/a-origem.jpg"
        }
      ]
    },
    {
      "id": 18,
      "nome": "Aniquilação",
      "ano": "2018",
      "diretor": "Alex Garland",
      "genero": "Ficção científica",
      "descricao": "O marido de Lena desaparece enquanto explorava uma misteriosa zona em quarentena pelo governo. Ela resolve se juntar à equipe encarregada de entrar na mesma área.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/aniquilacao.jpg"
        }
      ]
    },
    {
      "id": 19,
      "nome": "Lucy",
      "ano": "2014",
      "diretor": "Luc Besson",
      "genero": "Ficção científica",
      "descricao": "Lucy é obrigada a contrabandear drogas dentro do estômago. Mas o corpo da jovem absorve as substâncias e ela passa a ter superpoderes, como telepatia, telecinesia, a ausência de dor e a capacidade de adquirir conhecimento instantaneamente.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/lucy.jpg"
        }
      ]
    },
    {
      "id": 20,
      "nome": "A Guerra dos Mundos",
      "ano": "2005",
      "diretor": "Steven Spielberg",
      "genero": "Ficção científica",
      "descricao": "Ray Ferrier (Tom Cruise) é um homem divorciado que trabalha nas docas. Ele não se sente à vontade no papel de pai, mas precisa cuidar de seus filhos, Robbie (Justin Chatwin) e Rachel (Dakota Fanning), quando eles lhe fazem uma de suas raras visitas.",
      "poster": [
        {
          "url": "/assets/img/capa-filmes/guerra-mundos.jpg"
        }
      ]
    }
  ],
  "usuarios": [
    {
      "id": "2",
      "nome": "Wilander",
      "email": "u@gmail.com",
      "senha": "123"
    },
    {
      "id": "3",
      "nome": "Wilander",
      "email": "u@gmail.com",
      "senha": "123"
    },
    {
      "id": "5",
      "nome": "Wilander",
      "email": "u@gmail.com",
      "senha": "123"
    },
    {
      "id": "6",
      "nome": "Wilander",
      "email": "u@gmail.com",
      "senha": "123"
    },
    {
      "id": "7",
      "nome": "Wilander",
      "email": "u@gmail.com",
      "senha": "123"
    },
    {
      "id": "4",
      "nome": "Wilander",
      "email": "u@gmail.com",
      "senha": "123"
    },
    {
      "nome": "Glauber Ribeiro de Assis",
      "email": "glauber.assis@gmail.com",
      "senha": "teste",
      "id": "x4UkOu6"
    },
    {
      "nome": "Soraya dos Santos Serpa de Assis",
      "email": "sorayaserpa03@gmail.com",
      "senha": "asdfas",
      "id": "Qu_ZPXV"
    },
    {
      "nome": "teste",
      "email": "teste@teste",
      "senha": "teste",
      "id": "hYk9p8G"
    }
  ]
}